app/controllers/articles_controller.rb

  def index
    #Obtiene todos los datos de la tabla
    @articles = Article.paginate(page: params[:page],per_page:9).publicados.ultimos
---
SELECT "articles".* FROM "articles"

  def create
    @article = current_user.articles.new(article_params)
    @article.categories = params[:categories]
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Nuevo post"], ["body", "Este es un nuevo post"], ["created_at", "2017-06-01 19:07:56.861413"], ["updated_at", "2017-06-01 19:07:56.861413"]]
INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 15], ["category_id", 1], ["created_at", "2017-06-06 18:34:01.555613"], ["updated_at", "2017-06-06 18:34:01.555613"]]

  def destroy
    @article = Article.find(params[:id])
    @article.destroy  #Destroy elimina el objeto de la base de datos
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]