app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["body", "Hi :v"], ["created_at", "2017-06-05 17:24:23.810218"], ["updated_at", "2017-06-05 17:24:23.810218"]]